tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "scalacenter/bloop"
tap "railwaycat/emacsmacport"
tap "hashicorp/tap"
cask "alacritty"
cask "font-source-code-pro"
cask "font-fira-code"
cask "zed"
cask "visual-studio-code"
cask "obsidian"
brew "peco"
brew "git"
brew "tig"
brew "jq"
brew "gh"
brew "ghq"
brew "tmux"
brew "bat"
brew "wget"
brew "asdf"
brew "grpcurl"
brew "scalacenter/bloop/bloop"
brew "coursier/formulas/coursier" # TODO asdfから移行する
brew "kubectl"
brew "kubectx"
brew "pyenv"
brew "emacs-mac", args: ["with-modern-icon", "with-imagemagic"]
brew "stack"
brew "markdown"
brew "rust-analyzer"
brew "mysql"
brew "hashicorp/tap/vault"
brew "aws2-wrap"
