tap "scalacenter/bloop"
tap "railwaycat/emacsmacport"
tap "hashicorp/tap"
tap "Virtuslab/scala-cli"
cask "alacritty"
cask "font-source-code-pro"
cask "font-fira-code"
cask "zed"
cask "visual-studio-code"
cask "obsidian"
cask "tomatobar"
cask "rancher"
cask "ghostty"
brew "peco"
brew "git"
brew "tig"
brew "jq"
brew "gh"
brew "ghq"
brew "tmux"
brew "bat"
brew "wget"
brew "asdf"
brew "grpcurl"
brew "scalacenter/bloop/bloop"
brew "coursier/formulas/coursier" # TODO asdfから移行する
brew "kubectl"
brew "kubectx"
brew "pyenv"
brew "emacs-mac", args: ["with-modern-icon", "with-imagemagic"]
brew "stack"
brew "markdown"
brew "rust-analyzer"
brew "mysql-client@8.0"
brew "hashicorp/tap/vault"
brew "aws2-wrap"
brew "llvm" # for Scala Native
brew "bdw-gc" # for Scala Native
brew "the_silver_searcher"
brew "zig"
brew "kafka"
brew "ansible"
brew "scala-cli"
